Revit 2027 API
BuiltInFailures.ElectricalFailures.InvalidNumwiresSinglephase Property
 Invalid number of wires for single phase, only 2 and 3 are valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidNumwiresSinglephase { get; }
Public Shared ReadOnly Property InvalidNumwiresSinglephase As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidNumwiresSinglephase {
	FailureDefinitionId^ get ();
}
static member InvalidNumwiresSinglephase : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace